bit-finance/Catalogs/бит_ОбъектыСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ОбъектыСистемы</Name>
			<Comment>(БИТ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовСистемы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяОбъектаПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЗначенияОбъекта</Name>
					<Comment>(БИТ)</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отключено</Name>
					<Comment>Отключено действие механизма разделения доступа на уровне базы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокЭлемента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаголовокФормыВыбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

bit-finance/Enums/бит_ВидыОбъектовСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовСистемы</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Справочник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланСчетов</Name>
					<Comment>План счетов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПланВидовХарактеристик</Name>
					<Comment>План видов характеристик</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрСведений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрНакопления</Name>
					<Comment>Регистр накопления</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрБухгалтерии</Name>
					<Comment>Регистр бухгалтерии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
					<Comment>Задача</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БизнесПроцесс</Name>
					<Comment>Бизнес процесс</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bit-finance/Catalogs/бит_ОбъектыСистемы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Определяет настройки начального заполнения элементов
//
// Параметры:
//  Настройки - Структура - настройки заполнения
//   * ПриНачальномЗаполненииЭлемента - Булево - Если Истина, то для каждого элемента будет
//      вызвана процедура индивидуального заполнения ПриНачальномЗаполненииЭлемента.
Процедура ПриНастройкеНачальногоЗаполненияЭлементов(Настройки) Экспорт
	
	Настройки.ПриНачальномЗаполненииЭлемента = Ложь;
	
КонецПроцедуры

// Вызывается при начальном заполнении справочника.
//
// Параметры:
//  КодыЯзыков - Массив - список языков конфигурации. Актуально для мультиязычных конфигураций.
//  Элементы   - ТаблицаЗначений - данные заполнения. Состав колонок соответствует набору реквизитов
//                                 справочника бит_КомандыБотуТелеграм.
//  ТабличныеЧасти - Структура - описание табличных частей объекта, где:
//   * Ключ - Строка - имя табличной части;
//   * Значение - ТаблицаЗначений - табличная часть в виде таблицы значений, структуру которой
//                                  необходимо скопировать перед заполнением. Например:
//                                  Элемент.Ключи = ТабличныеЧасти.Ключи.Скопировать();
//                                  ЭлементТЧ = Элемент.Ключи.Добавить();
//                                  ЭлементТЧ.ИмяКлюча = "Первичный";
//
Процедура ПриНачальномЗаполненииЭлементов(КодыЯзыков, Элементы, ТабличныеЧасти = Неопределено) Экспорт
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Справочники";
	Элемент.ВидОбъекта			 	  = Перечисления.бит_ВидыОбъектовСистемы.Справочник;
	Элемент.Код 					  = "000000001";
	Элемент.Наименование 			  = НСтр("ru = 'Справочники'; en = 'Catalogs'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Документы";
	Элемент.ВидОбъекта 			  	  = Перечисления.бит_ВидыОбъектовСистемы.Документ;
	Элемент.Код						  = "000000002";
	Элемент.Наименование 			  = НСтр("ru = 'Документы'; en = 'Documents'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Отчеты";
	Элемент.ВидОбъекта			 	  = Перечисления.бит_ВидыОбъектовСистемы.Отчет;
	Элемент.Код						  = "000000003";
	Элемент.Наименование			  = НСтр("ru = 'Отчеты'; en = 'Reports'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Обработки";
	Элемент.ВидОбъекта			  	  = Перечисления.бит_ВидыОбъектовСистемы.Обработка;
	Элемент.Код						  = "000000004";
	Элемент.Наименование			  = НСтр("ru = 'Обработки'; en = 'Data processors'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РегистрыСведений";
	Элемент.ВидОбъекта			  	  = Перечисления.бит_ВидыОбъектовСистемы.РегистрСведений;
	Элемент.Код						  = "000000005";
	Элемент.Наименование			  = НСтр("ru = 'Регистры сведений'; en = 'Information Registers'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РегистрыНакопления";
	Элемент.ВидОбъекта			 	  = Перечисления.бит_ВидыОбъектовСистемы.РегистрНакопления;
	Элемент.Код						  = "000000006";
	Элемент.Наименование			  = НСтр("ru = 'Регистры накопления'; en = 'Accumulation Registers'", ОбщегоНазначения.КодОсновногоЯзыка());
	Элемент = Элементы.Добавить();  
	
	Элемент.ИмяПредопределенныхДанных = "ПланыСчетов";
	Элемент.ВидОбъекта			 	  = Перечисления.бит_ВидыОбъектовСистемы.ПланСчетов;
	Элемент.Код						  = "000000007";
	Элемент.Наименование			  = НСтр("ru = 'Планы счетов'; en = 'Charts Of Accounts'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "ПланыВидовХарактеристик";
	Элемент.ВидОбъекта			  	  = Перечисления.бит_ВидыОбъектовСистемы.ПланВидовХарактеристик;
	Элемент.Код						  = "000000008";
	Элемент.Наименование			  = НСтр("ru = 'Планы видов характеристик'; en = 'Charts Of Characteristic Types'", ОбщегоНазначения.КодОсновногоЯзыка());

	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "РегистрыБухгалтерии";
	Элемент.ВидОбъекта			  	  = Перечисления.бит_ВидыОбъектовСистемы.РегистрБухгалтерии;
	Элемент.Код						  = "000000009";
	Элемент.Наименование			  = НСтр("ru = 'Регистры бухгалтерии'; en = 'Accounting Registers'", ОбщегоНазначения.КодОсновногоЯзыка());
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "Задачи";
	Элемент.ВидОбъекта				  = Перечисления.бит_ВидыОбъектовСистемы.Задача;
	Элемент.Код						  = "000000010";
	Элемент.Наименование 			  = НСтр("ru = 'Задачи'; en = 'Tasks'",ОбщегоНазначения.КодОсновногоЯзыка());
	
	Элемент = Элементы.Добавить();
	Элемент.ИмяПредопределенныхДанных = "БизнесПроцессы";
	Элемент.ВидОбъекта				  = Перечисления.бит_ВидыОбъектовСистемы.БизнесПроцесс;
	Элемент.Код						  = "000000011";
	Элемент.Наименование 			  = НСтр("ru = 'Бизнес процессы'; en = 'Business processes'",ОбщегоНазначения.КодОсновногоЯзыка());

КонецПроцедуры

// См. бит_ОбновлениеИнформационнойБазыБФ.ПередОбновлениемИнформационнойБазы().
//
Процедура ОбновитьЗаполненныеЭлементыПриПереходеНаНовуюВерсию() Экспорт
	
	МетаданныеОбъекта = ПустаяСсылка().Метаданные();
	ОбновлениеИнформационнойБазы.ОбновитьПредопределенныеЭлементы(МетаданныеОбъекта);
	
КонецПроцедуры

// Возвращает объект системы по полному имени метаданного.
//
// Параметры:
//  ИмяОбъектаПолное - Строка.
// 
// Возвращаемое значение:
//  СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ОбъектСистемыПоПолномуИмени(ИмяОбъектаПолное) Экспорт
	
	Возврат бит_ОбщегоНазначенияПовтИсп.ОбъектСистемыПоПолномуИмени(ИмяОбъектаПолное);
	
КонецФункции

// Возвращает объект системы по метаданным.
//
// Параметры:
//  ОбъектыМетаданных - Массив, метаданные для поиска
// 
// Возвращаемое значение:
//  Массив.
//
Функция ОбъектыСистемыПоОбъектамМетаданных(ОбъектыМетаданных) Экспорт
	
	ОбъектыСистемы = Новый Массив; 
	
	Если ТипЗнч(ОбъектыМетаданных) <> Тип("Массив") Тогда
		Имена = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ОбъектыМетаданных.ПолноеИмя());
	Иначе	
		Имена = Новый Массив; 
		Для каждого Элемент Из ОбъектыМетаданных Цикл
			Имена.Добавить(Элемент.ПолноеИмя());
		КонецЦикла; 
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_ОбъектыСистемы.Ссылка КАК Ссылка,
	|	бит_ОбъектыСистемы.ИмяОбъектаПолное КАК ИмяОбъектаПолное
	|ИЗ
	|	Справочник.бит_ОбъектыСистемы КАК бит_ОбъектыСистемы
	|ГДЕ
	|	бит_ОбъектыСистемы.ИмяОбъектаПолное В(&Имена)";
	
	Запрос.УстановитьПараметр("Имена", Имена);
	
	Результат = Запрос.Выполнить();
	Выборка	  = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбъектыСистемы.Добавить(Выборка.Ссылка);
	КонецЦикла;

	Возврат ОбъектыСистемы;
	
КонецФункции

// Возвращает объект системы по метаданным.
//
// Параметры:
//  ОбъектМетаданных - Метаданные для поиска
// 
// Возвращаемое значение:
//  СправочникСсылка.бит_ОбъектыСистемы.
//
Функция ОбъектСистемыПоОбъектуМетаданных(ОбъектМетаданных) Экспорт

	Возврат ОбъектСистемыПоПолномуИмени(ОбъектМетаданных.ПолноеИмя());
	
КонецФункции

// Возвращает объект метаданных по объекту системы.
//
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы - Объект системы.
// 
// Возвращаемое значение:
//  ОбъектМетаданных.
//
Функция ОбъектМетаданныхПоОбъектуСистемы(ОбъектСистемы) Экспорт
	
	Возврат бит_ОбщегоНазначенияПовтИсп.ОбъектМетаданныхПоОбъектуСистемы(ОбъектСистемы);
	
КонецФункции

// Возвращает тип значения ссылки по объекту системы.
//
// Параметры:
//  ОбъектСистемы - СправочникСсылка.бит_ОбъектыСистемы - Объект системы.
// 
// Возвращаемое значение:
//  Тип.
//
Функция ТипСсылки(ОбъектСистемы) Экспорт
	
	ОбъектМетаданных = ОбъектМетаданныхПоОбъектуСистемы(ОбъектСистемы);
	ИмяТипа          = ОбъектМетаданных.ПолноеИмя();
	ИмяТипа          = СтрЗаменить(ИмяТипа, ".", "Ссылка.");
	Попытка
		ТипСсылки = Тип(ИмяТипа);
	Исключение
		ТипСсылки = Неопределено;
		ТекстСообщения = НСтр("ru='Не удалось получить значение типа для %1'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ОбъектСистемы);
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат ТипСсылки;
	
КонецФункции
 
#КонецОбласти

#КонецЕсли
